Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/atdf/PIC32CX1025SG41128.atdf
        <register name="IMR" offset="0x30" rw="R" size="4" access-size="4" initval="0x3FFFFFFF" caption="Interrupt Mask Register">
          <bitfield name="MFS" caption="Management Frame Sent" mask="0x1"/>
          <bitfield name="RCOMP" caption="Receive Complete" mask="0x2"/>
          <bitfield name="RXUBR" caption="RX Used Bit Read" mask="0x4"/>
          <bitfield name="TXUBR" caption="TX Used Bit Read" mask="0x8"/>
          <bitfield name="TUR" caption="Transmit Underrun" mask="0x10"/>
          <bitfield name="RLEX" caption="Retry Limit Exceeded" mask="0x20"/>
          <bitfield name="TFC" caption="Transmit Frame Corruption Due to AHB Error" mask="0x40"/>
          <bitfield name="TCOMP" caption="Transmit Complete" mask="0x80"/>
          <bitfield name="ROVR" caption="Receive Overrun" mask="0x400"/>
          <bitfield name="HRESP" caption="HRESP Not OK" mask="0x800"/>
          <bitfield name="PFNZ" caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x1000"/>
          <bitfield name="PTZ" caption="Pause Time Zero" mask="0x2000"/>
          <bitfield name="PFTR" caption="Pause Frame Transmitted" mask="0x4000"/>
          <bitfield name="EXINT" caption="External Interrupt" mask="0x8000"/>
          <bitfield name="DRQFR" caption="PTP Delay Request Frame Received" mask="0x40000"/>
          <bitfield name="SFR" caption="PTP Sync Frame Received" mask="0x80000"/>
          <bitfield name="DRQFT" caption="PTP Delay Request Frame Transmitted" mask="0x100000"/>
          <bitfield name="SFT" caption="PTP Sync Frame Transmitted" mask="0x200000"/>
          <bitfield name="PDRQFR" caption="PDelay Request Frame Received" mask="0x400000"/>
          <bitfield name="PDRSFR" caption="PDelay Response Frame Received" mask="0x800000"/>
          <bitfield name="PDRQFT" caption="PDelay Request Frame Transmitted" mask="0x1000000"/>
          <bitfield name="PDRSFT" caption="PDelay Response Frame Transmitted" mask="0x2000000"/>
          <bitfield name="SRI" caption="TSU Seconds Register Increment" mask="0x4000000"/>
          <bitfield name="RXLPISBC" caption="Enable RX LPI Indication" mask="0x8000000"/>
          <bitfield name="WOL" caption="Wake On Lan" mask="0x10000000"/>
          <bitfield name="TSUCMP" caption="Tsu timer comparison" mask="0x20000000"/>
        </register>
        <register name="MAN" offset="0x34" rw="RW" size="4" access-size="4" initval="0x00000000" caption="PHY Maintenance Register">
          <bitfield name="DATA" caption="PHY Data" mask="0xFFFF"/>
          <bitfield name="WTN" caption="Write Ten" mask="0x30000"/>
          <bitfield name="REGA" caption="Register Address" mask="0x7C0000"/>
          <bitfield name="PHYA" caption="PHY Address" mask="0xF800000"/>
          <bitfield name="OP" caption="Operation" mask="0x30000000"/>
          <bitfield name="CLTTO" caption="Clause 22 Operation" mask="0x40000000"/>
          <bitfield name="WZO" caption="Write ZERO" mask="0x80000000"/>
        </register>
        <register name="RPQ" offset="0x38" rw="R" size="4" access-size="4" initval="0x00000000" caption="Received Pause Quantum Register">
          <bitfield name="RPQ" caption="Received Pause Quantum" mask="0xFFFF"/>
        </register>
        <register name="TPQ" offset="0x3C" rw="RW" size="4" access-size="4" initval="0x0000FFFF" caption="Transmit Pause Quantum Register">
          <bitfield name="TPQ" caption="Transmit Pause Quantum" mask="0xFFFF"/>
        </register>
        <register name="TPSF" offset="0x40" rw="RW" size="4" access-size="4" initval="0x000003FF" caption="TX partial store and forward Register">
          <bitfield name="TPB1ADR" caption="TX packet buffer address" mask="0x3FF"/>
          <bitfield name="ENTXP" caption="Enable TX partial store and forward operation" mask="0x80000000"/>
        </register>
        <register name="RPSF" offset="0x44" rw="RW" size="4" access-size="4" initval="0x000003FF" caption="RX partial store and forward Register">
          <bitfield name="RPB1ADR" caption="RX packet buffer address" mask="0x3FF"/>
          <bitfield name="ENRXP" caption="Enable RX partial store and forward operation" mask="0x80000000"/>
        </register>
        <register name="RJFML" offset="0x48" rw="RW" size="4" access-size="4" initval="0x00003FFF" caption="RX Jumbo Frame Max Length Register">
          <bitfield name="FML" caption="Frame Max Length" mask="0x3FFF"/>
        </register>
        <register name="HRB" offset="0x80" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Hash Register Bottom [31:0]">
          <bitfield name="ADDR" caption="Hash Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="HRT" offset="0x84" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Hash Register Top [63:32]">
          <bitfield name="ADDR" caption="Hash Address" mask="0xFFFFFFFF"/>
        </register>
        <register-group name="SA" name-in-module="SA" offset="0x088" size="0x8" count="4"/>
        <register name="TIDM" offset="0xA8" rw="RW" size="4" access-size="4" count="4" initval="0x00000000" caption="Type ID Match n Register">
          <bitfield name="TID" caption="Type ID Match n" mask="0xFFFF"/>
          <bitfield name="ENID" caption="Enable Copying of TID n Matched Frames" mask="0x80000000"/>
        </register>
        <register name="WOL" offset="0xB8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Wake on LAN">
          <bitfield name="IP" caption="IP address" mask="0xFFFF"/>
          <bitfield name="MAG" caption="Event enable" mask="0x10000"/>
          <bitfield name="ARP" caption="LAN ARP req" mask="0x20000"/>
          <bitfield name="SA1" caption="WOL specific address reg 1" mask="0x40000"/>
          <bitfield name="MTI" caption="WOL LAN multicast" mask="0x80000"/>
        </register>
        <register name="IPGS" offset="0xBC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="IPG Stretch Register">
          <bitfield name="FL" caption="Frame Length" mask="0xFFFF"/>
        </register>
        <register name="SVLAN" offset="0xC0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Stacked VLAN Register">
          <bitfield name="VLAN_TYPE" caption="User Defined VLAN_TYPE Field" mask="0xFFFF"/>
          <bitfield name="ESVLAN" caption="Enable Stacked VLAN Processing Mode" mask="0x80000000"/>
        </register>
        <register name="TPFCP" offset="0xC4" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Transmit PFC Pause Register">
          <bitfield name="PEV" caption="Priority Enable Vector" mask="0xFF"/>
          <bitfield name="PQ" caption="Pause Quantum" mask="0xFF00"/>
        </register>
        <register name="SAMB1" offset="0xC8" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Specific Address 1 Mask Bottom [31:0] Register">
          <bitfield name="ADDR" caption="Specific Address 1 Mask" mask="0xFFFFFFFF"/>
        </register>
        <register name="SAMT1" offset="0xCC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Specific Address 1 Mask Top [47:32] Register">
          <bitfield name="ADDR" caption="Specific Address 1 Mask" mask="0xFFFF"/>
        </register>
        <register name="NSC" offset="0xDC" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Tsu timer comparison nanoseconds Register">
          <bitfield name="NANOSEC" caption="1588 Timer Nanosecond comparison value" mask="0x1FFFFF"/>
        </register>
