Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.17/atdf/PIC32CX1025SG41128.atdf
      <value-group name="SDHC_PSR__CARDSS">
        <value name="NO" caption="Reset or Debouncing" value="0"/>
        <value name="YES" caption="No Card or Insered" value="1"/>
      </value-group>
      <value-group name="SDHC_PSR__CMDINHC">
        <value name="CAN" caption="Can issue command using only CMD line" value="0"/>
        <value name="CANNOT" caption="Cannot issue command" value="1"/>
      </value-group>
      <value-group name="SDHC_PSR__CMDINHD">
        <value name="CAN" caption="Can issue command which uses the DAT line" value="0"/>
        <value name="CANNOT" caption="Cannot issue command which uses the DAT line" value="1"/>
      </value-group>
      <value-group name="SDHC_PSR__DLACT">
        <value name="INACTIVE" caption="DAT Line Inactive" value="0"/>
        <value name="ACTIVE" caption="DAT Line Active" value="1"/>
      </value-group>
      <value-group name="SDHC_PSR__RTACT">
        <value name="NO" caption="No valid data" value="0"/>
        <value name="YES" caption="Transferring data" value="1"/>
      </value-group>
      <value-group name="SDHC_PSR__RTREQ">
        <value name="OK" caption="Fixed or well-tuned sampling clock" value="0"/>
        <value name="REQUIRED" caption="Sampling clock needs re-tuning" value="1"/>
      </value-group>
      <value-group name="SDHC_PSR__WRPPL">
        <value name="PROTECTED" caption="Write protected (SDWP#=0)" value="0"/>
        <value name="ENABLED" caption="Write enabled (SDWP#=1)" value="1"/>
      </value-group>
      <value-group name="SDHC_PSR__WTACT">
        <value name="NO" caption="No valid data" value="0"/>
        <value name="YES" caption="Transferring data" value="1"/>
      </value-group>
      <value-group name="SDHC_HC1R__CARDDSEL">
        <value name="NORMAL" caption="SDCD# is selected (for normal use)" value="0"/>
        <value name="TEST" caption="The Card Select Test Level is selected (for test purpose)" value="1"/>
      </value-group>
      <value-group name="SDHC_HC1R__CARDDTL">
        <value name="NO" caption="No Card" value="0"/>
        <value name="YES" caption="Card Inserted" value="1"/>
      </value-group>
      <value-group name="SDHC_HC1R__DMASEL">
        <value name="SDMA" caption="SDMA is selected" value="0"/>
        <value name="32BIT" caption="32-bit Address ADMA2 is selected" value="2"/>
      </value-group>
      <value-group name="SDHC_HC1R__DW">
        <value name="1BIT" caption="1-bit mode" value="0"/>
        <value name="4BIT" caption="4-bit mode" value="1"/>
      </value-group>
      <value-group name="SDHC_HC1R__HSEN">
        <value name="NORMAL" caption="Normal Speed mode" value="0"/>
        <value name="HIGH" caption="High Speed mode" value="1"/>
      </value-group>
      <value-group name="SDHC_HC1R__LEDCTRL">
        <value name="OFF" caption="LED off" value="0"/>
        <value name="ON" caption="LED on" value="1"/>
      </value-group>
      <value-group name="SDHC_PCR__SDBPWR">
        <value name="OFF" caption="Power off" value="0"/>
        <value name="ON" caption="Power on" value="1"/>
      </value-group>
      <value-group name="SDHC_PCR__SDBVSEL">
        <value name="1V8" caption="1.8V (Typ.)" value="5"/>
        <value name="3V0" caption="3.0V (Typ.)" value="6"/>
        <value name="3V3" caption="3.3V (Typ.)" value="7"/>
      </value-group>
      <value-group name="SDHC_BGCR__CONTR">
        <value name="GO_ON" caption="Not affected" value="0"/>
        <value name="RESTART" caption="Restart" value="1"/>
      </value-group>
      <value-group name="SDHC_BGCR__INTBG">
        <value name="DISABLED" caption="Disabled" value="0"/>
        <value name="ENABLED" caption="Enabled" value="1"/>
      </value-group>
      <value-group name="SDHC_BGCR__RWCTRL">
        <value name="DISABLE" caption="Disable Read Wait Control" value="0"/>
        <value name="ENABLE" caption="Enable Read Wait Control" value="1"/>
      </value-group>
      <value-group name="SDHC_BGCR__STPBGR">
        <value name="TRANSFER" caption="Transfer" value="0"/>
        <value name="STOP" caption="Stop" value="1"/>
      </value-group>
      <value-group name="SDHC_WCR__WKENCINS">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="SDHC_WCR__WKENCINT">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="SDHC_WCR__WKENCREM">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="SDHC_CCR__CLKGSEL">
        <value name="DIV" caption="Divided Clock Mode" value="0"/>
        <value name="PROG" caption="Programmable Clock Mode" value="1"/>
      </value-group>
      <value-group name="SDHC_CCR__INTCLKEN">
        <value name="OFF" caption="Stop" value="0"/>
        <value name="ON" caption="Oscillate" value="1"/>
      </value-group>
      <value-group name="SDHC_CCR__INTCLKS">
        <value name="NOT_READY" caption="Not Ready" value="0"/>
        <value name="READY" caption="Ready" value="1"/>
      </value-group>
      <value-group name="SDHC_CCR__SDCLKEN">
        <value name="DISABLE" caption="Disable" value="0"/>
        <value name="ENABLE" caption="Enable" value="1"/>
      </value-group>
      <value-group name="SDHC_SRR__SWRSTALL">
        <value name="WORK" caption="Work" value="0"/>
        <value name="RESET" caption="Reset" value="1"/>
      </value-group>
      <value-group name="SDHC_SRR__SWRSTCMD">
        <value name="WORK" caption="Work" value="0"/>
        <value name="RESET" caption="Reset" value="1"/>
      </value-group>
      <value-group name="SDHC_SRR__SWRSTDAT">
        <value name="WORK" caption="Work" value="0"/>
        <value name="RESET" caption="Reset" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__BLKGE">
        <value name="NO" caption="No Block Gap Event" value="0"/>
        <value name="STOP" caption="Transaction stopped at block gap" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__BRDRDY">
        <value name="NO" caption="Not ready to read buffer" value="0"/>
        <value name="YES" caption="Ready to read buffer" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__BWRRDY">
        <value name="NO" caption="Not ready to write buffer" value="0"/>
        <value name="YES" caption="Ready to write buffer" value="1"/>
      </value-group>
      <value-group name="SDHC_NISTR__CINS">
        <value name="NO" caption="Card state stable or Debouncing" value="0"/>
        <value name="YES" caption="Card inserted" value="1"/>
      </value-group>
